#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dhoppeIT/terraform/runs/run-yagZHLxBVdsBSpQZ

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.tfe-organization.tfe_organization.default: Refreshing state... [id=dhoppeIT]
module.tfe-organization.tfe_organization_token.default: Refreshing state... [id=dhoppeIT]
module.tfe-oauth_client.tfe_oauth_client.default: Refreshing state... [id=oc-QhxJ1uU28N1QWy4S]
module.tfe-workspace_terraform.tfe_workspace.default: Refreshing state... [id=ws-28DGqJJq9TJhn1Md]
module.tfe-workspace_aws.tfe_workspace.default: Refreshing state... [id=ws-f8DHZS8QXj5GvUHM]
module.tfe-registry["tfe-notification"].tfe_registry_module.default: Refreshing state... [id=mod-EHbfzdGNNxtMwRVR]
module.tfe-registry["tfe-registry"].tfe_registry_module.default: Refreshing state... [id=mod-uUe6QLD8BAzSwt8M]
module.tfe-registry["tfe-variable"].tfe_registry_module.default: Refreshing state... [id=mod-Er3fLtuh364S48r8]
module.tfe-registry["tfe-workspace"].tfe_registry_module.default: Refreshing state... [id=mod-Aw9mwD9ywRDhWSdk]
module.tfe-registry["tfe-oauth_client"].tfe_registry_module.default: Refreshing state... [id=mod-viyeWMGM2cF3fLrA]
module.tfe-registry["tfe-organization"].tfe_registry_module.default: Refreshing state... [id=mod-5KYHsU4SNwGFpoGF]
module.tfe-notification_terraform.tfe_notification_configuration.default: Refreshing state... [id=nc-KQLuHzfeYK7s36cR]
module.tfe-variable_terraform["github_token"].tfe_variable.default: Refreshing state... [id=var-VF1xaVbq6tDw2mWB]
module.tfe-variable_terraform["slack_webhook_url"].tfe_variable.default: Refreshing state... [id=var-JqEzfCvKPcdjuxub]
module.tfe-variable_aws["slack_webhook_url"].tfe_variable.default: Refreshing state... [id=var-iBZyzxxuAYAsfnvt]
module.tfe-notification_aws.tfe_notification_configuration.default: Refreshing state... [id=nc-nhrWzgwUx8vjUPsb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tfe-team.tfe_team.default will be created
  + resource "tfe_team" "default" {
      + id           = (known after apply)
      + name         = "owners"
      + organization = "dhoppeIT"
      + visibility   = "secret"

      + organization_access {
          + manage_policies         = (known after apply)
          + manage_policy_overrides = (known after apply)
          + manage_vcs_settings     = (known after apply)
          + manage_workspaces       = (known after apply)
        }
    }

  # module.tfe-team.tfe_team_token.default will be created
  + resource "tfe_team_token" "default" {
      + force_regenerate = false
      + id               = (known after apply)
      + team_id          = (known after apply)
      + token            = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @dhoppe, Action: `pull_request`*